/*
*********************************************************************************************************
*
*                   (c) Copyright 2003-2017, INITEC, Ekaterinburg. Russia.
*                                    All Rights Reserved
*
*
* Project     : Any
*
* Filemane    : Keyb.h
*
* Target      : Independent
* For         : ANSI C
*
* Description : Заголовочный файл класса клавиатуры.
*
*
*********************************************************************************************************
*/

/*
*********************************************************************************************************
*
*                                         REVISION HISTORY
*
*
* Created     : Крылосов Е.Н.
* By          : 01.07.2017
*
*********************************************************************************************************
*/

#if     !defined(KEYB_H)
#define KEYB_H

/*
*********************************************************************************************************
*                                              CONSTANTS
*********************************************************************************************************
*/

  #define KEYB_EVENT_PRESS_BTN_1            1
  #define KEYB_EVENT_PRESS_BTN_2            2
  #define KEYB_EVENT_PRESS_BTN_3            3
  #define KEYB_EVENT_PRESS_BTN_4            4

  #define KEYB_EVENT_UN_PRESS_BTN_1         6
  #define KEYB_EVENT_UN_PRESS_BTN_2         7
  #define KEYB_EVENT_UN_PRESS_BTN_3         8
  #define KEYB_EVENT_UN_PRESS_BTN_4         9

/*
*********************************************************************************************************
*                                            GLOBAL MACROS
*********************************************************************************************************
*/

/*
*********************************************************************************************************
*                                          GLOBAL DATA TYPES
*********************************************************************************************************
*/

// Класс клавитуры.
class Keyb
{
private:
  int TIME_INPUT_READ     = 10;     // Период чтения входов (мс).
  int INPUT_HOLD_COUNT    = 5;      // Количество чтений входа для определения его как захваченное.
  int TIME_LONG_PRESS     = 1000;   // Время длительного нажатия.
  int TIME_PEREAT_PRESS   = 200;    // Время автоповтора нажатия.

  int inputPin1;                    // Номер пина входа 1.
  int inputPin2;                    // Номер пина входа 2.
  int inputPin3;                    // Номер пина входа 3.
  int inputPin4;                    // Номер пина входа 4.
  
  int statePin;                     // Текущее состояние.
  int statePinOld;                  // Предыдущее состояние.
  int stateHold;                    // Захваченное состояние.
  int stateHoldOld;                 // Предыдущее захваченное состояние.

  int event;                        // Код события.
  int end_event_flag;               // Флаг события.

  int longPressFlag;                // Флаг долгого удержания.

  int           inputHoldCount;     // Счетчик для определения захваченного состояния.
  unsigned long millisInputHoldOld; // Время предыдущего момента.

  void inputReadQuant     ();
  int  getStatePins       ();

public:
  Keyb                    (int pin1, int pin2, int pin3, int pin4);

  int   getEvent          ();
  int   getEventFlag      ();
  int   resetEventFlag    ();
  void  run               ();
};

/*
*********************************************************************************************************
*                                           GLOBAL VARIABLES
*********************************************************************************************************
*/


/*
*********************************************************************************************************
*                                               EXTERNALS
*********************************************************************************************************
*/

/*
*********************************************************************************************************
*                                      GLOBAL FUNCTION PROTOTYPES
*********************************************************************************************************
*/

#endif
